Repository: EugeneDenkevich/KamiBot
Catalog: kami/locales/*/LC_MESSAGES/kami.po
Languages: it

source: Hello, beautiful soul! Your account is activated. Thank you very much for your trust.Click here to start learning 👉🏻 /start
it: Hello, beautiful soul! Il suo account è stato attivato. Grazie mille per la vostra fiducia. Clicca qui per iniziare a imparare 👉🏻 /start

source: Awaiting time is up. Continue dialog here /dialog.
it: Il tempo di attesa è un pacco. Continua il dialogo qui /dialog.

source: Click the 'Share Contact' button to log in 👇
it: Fare clic sul pulsante “Condividi contatto” per autorizzarsi 👇

source: Dialogues
it: Dialoghi

source: Let's practice 🗣 English! 😎 Select any topic to begin the dialog and we'll be able to talk by voice messages on this topic:
it: Cominciamo ad esercitarci a comunicare 🗣 in inglese! 😎 Scegliete un argomento qualsiasi per iniziare a comunicare e noi potremo comunicare con voi tramite messaggi vocali su quell'argomento:

source: 🥰 Welcome back, let's continue our communication practice! 👇 Choose any topic that we will talk about today. 🗣 If you want to continue the previous dialogue, select Continue previous dialogue:
it: 🥰 Welcome back, continuiamo la pratica della comunicazione! 👇 Scegli l'argomento su cui comunicheremo oggi. 🗣 Se vuoi continuare il dialogo precedente, selezionate Continua dialogo precedente:

source: Input your topic, please
it: Scrivi l'argomento di cui vorreste parlare.

source: One moment...
it: Un attimo...

source: You dont have a created dialog yet! Choose a topic for the dialogue and start your first dialogue.
it: Non hai ancora creato un dialogo! Scegli un argomento per il dialogo e inizia il tuo primo dialogo.

source: Language Level
it: Livello linguistico

source: 📑 I'll send you the first example from the test. 🖋 Write or dictate the correct answer with your voice, then I will send you the next one.
it: 📑 Ecco il primo esempio del test. 🖋 Scrivi o esprimi a voce la risposta corretta, poi ti invio quella successiva.

source: Test is creating...
it: Il test sta creando...

source: Error while test creating: NoAiError
it: Errore durante la creazione del test: NoAiError

source: Test was created.
it: Il test è stato creato.

source: Very good! Yor result is: {rate}.
it: Molto bene! Il vostro livello: {rate}.

source: Now i recommend you to practise your speaking skills.
it: Ora ti consiglio di mettere in pratica le tue capacità oratorie.

source: Yor result is: {rate}.
it: Il vostro livello: {rate}.

source: Now I'll tell you how to use all my features, and then we can test your English level.
it: Ora ti spiegherò come usare tutte le mie funzioni e poi potremo testare il tuo livello di inglese.

source: Cool idea 😊
it: Idea fantastica 😊

source: 👇At the bottom there is a quick menu with basic functions: 📍Dialogues 📍Language Level 📍Translator
it: 👇 In basso è presente un menu rapido con le funzioni principali: 📍 Dialoghi 📍 Livello linguistico 📍 Traduttore

source: 🔴<b>Click</b> on these buttons to quickly select the desired function. And also the <b>Menu</b> button with additional functions: 📍Onboarding
it: 🔴<b>Premi</b> questi pulsanti per selezionare rapidamente la funzione desiderata. È presente anche un pulsante <b>Menu</b> con funzioni aggiuntive: 📍 Onboarding

source: Got it
it: Ho capito

source: Now I will show you how to use the basic functions. But you can always go through this training again.
it: Ora vi mostrerò come utilizzare le funzioni di base. Ma potete sempre ripassare questa formazione.

source: 📹 This video shows how to work with “Dialogues”. 👀 Watch the video, then click the “Got it” button
it: 📹 Questo video mostra come funziona il “Dialoghi”. 👀 Guarda il video e poi fai clic sul pulsante “Ho capito”

source: Got it 😉
it: Ho capito 😉

source: This video shows how the “Translator” works. Watch the video, then click the “Got it” button
it: Questo video mostra come funziona il “Traduttore”. Guarda il video, quindi fai clic sul pulsante “Ho capito”.

source: Got it 😊
it: Ho capito😊

source: This video shows how the “Language Level” works. Watch the video, then click the “Got it” button
it: Questo video mostra come funziona il “Livello di lingua”. Guarda il video, quindi fai clic sul pulsante “Ho capito”.

source: 😉 Great, it's time to determine your <b>level</b> of English. 🧐 Click the <b>button below</b> 🖲 and take the 6-question test. 📝 This will help me choose the style and phrases to communicate with you.
it: 😉 Ottimo, è il momento di determinare il vostro livello di inglese. 🧐 Clicca sul <b>pulsante qui sotto </b> 🖲 e fai il quiz di 6 domande. 📝Questo mi aiuterà ad abbinare il mio stile e le mie frasi con te.

source: Language level test start 😉
it: Test di livello linguistico 😉

source: 👀 Watch the videonote and everything will become clear.
it: 👀 Guardate il video e ti sarà chiaro tutto.

source: The administrator will check your data. If your subscription is paid, you will receive a notification and all the functions of the bot will work
it: L'amministratore verificherà le vostre informazioni. Se l'abbonamento è stato pagato, si riceverà una notifica corrispondente e tutte le funzioni del bot funzioneranno.

source: Hello, I'm Kami, your online English teacher!
it: Ciao, sono Kami, la tua insegnante d’inglese online!

source: Hello, Kami 👋
it: Hi, Kami 👋

source: If you have found errors in the work of AI Kami or do not understand how the functionality works, write here: @NikMer
it: Se avete riscontrato degli errori nel lavoro di AI Kami o non capite come funziona la funzionalità, scrivete qui: @NikMer

source: Translator
it: Traduttore

source: 👇 Choose the language in which you want to translate.
it: 👇 Scegli la lingua in cui volete tradurre.

source: Now it is possible to send a message: 🖋 as text 🗣 or voice I will translate it and send a response via SMS. ❕ If you wish to change the translation direction, press the Menu button and select the translation language again.
it: Ora è possibile inviare un messaggio: 🖋 di testo 🗣 o vocale Lo tradurrò e invierò una risposta via SMS. ❕ Se si desidera cambiare la direzione di traduzione, premere il pulsante Menu e selezionare nuovamente la lingua di traduzione.

source: Now let's start a dialogue practice
it: Adesso iniziamo una pratica di dialogo

source: A trip to the airport ✈️
it: Viaggio verso l'aeroporto ✈️

source: Acquaintance 👫
it: Conoscere persone 👫

source: Ordering food at a restaurant 🍔
it: Ordinare cibo al ristorante🍔

source: Job interview 👩‍💼
it: Colloquio di lavoro👩‍💼

source: My topic 💃
it: Argomento di tua scelta💃

source: Continue dialogue
it: Continuare il dialogo precedente

source: Let's get started 📝
it: Iniziamo 📝

source: Show where it is
it: Mostra dove si trova

source: Share contact 📱
it: Condividi contatto 📱

source: {language} → English
it: {language} → Inglese

source: English → {language}
it: Inglese → {language}
